app/controllers/application_controller.rb

	def play
		@sound = Sound.find_by_id(params[:id]) || Sound.find_by_label(params[:id])
---
SELECT * FROM "sounds" WHERE ("sounds"."id" = '2') LIMIT 1

	def say
		@phrase = Phrase.find_by_id(params[:id]) || Phrase.find_by_label(params[:id])
---
SELECT * FROM "phrases" WHERE ("phrases"."id" = '1') LIMIT 1

	def forget
		p = Phrase.find_by_id params[:id]
		p.destroy if p
---
SELECT * FROM "phrases" WHERE ("phrases"."id" = '1') LIMIT 1
DELETE FROM "phrases" WHERE "id" = 1

	def delete
		s = Sound.find_by_id params[:id]
		s.destroy if s
---
SELECT * FROM "sounds" WHERE ("sounds"."id" = '2') LIMIT 1
DELETE FROM "sounds" WHERE "id" = 2

	def upload
		full_path = "#{Dir.pwd}/uploads/#{params[:file].original_filename}"
		`cp #{params[:file].path} #{full_path}`
		`chmod 777 #{full_path}` # file is owned by root because we are running on port 80.
		Sound.create({
			:path => full_path,
			:label => params[:label],
			:filename => params[:file].original_filename
		})
---
INSERT INTO "sounds" ("label", "created_at", "updated_at", "path", "filename") VALUES('thunder', '2012-06-11 18:36:22', '2012-06-11 18:36:22', '/Users/User/team/rawr-box/uploads/thunderclap.wav', 'thunderclap.wav')

	def learn
		p = Phrase.create({
			:phrase => params[:phrase],
			:label  => params[:label],
			:voice  => params[:voice]
		})
---
INSERT INTO "phrases" ("label", "created_at", "phrase", "updated_at", "voice") VALUES('rawrbot', '2012-06-11 18:20:22', 'testing rawr box', '2012-06-11 18:20:22', 'default')